run/cases/pelletExtruder/nonMRF/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{  
    wall1
    {
        type            slip;
    }
    
    wall2
    {
        type            noSlip;
    }
    
    screw
    {
        type            slip;
    }
    
    outlet
    {
        type            zeroGradient;
    }

    inlet
    {
        type                flowRateInletVelocity;
        massFlowRate        3e-05;// kg/s
        extrapolateProfile  yes;
        rho                 rho;
        rhoInlet            1040;
        value               uniform (0 0 0);    
    }
}


// ************************************************************************* //
