run/cases/pelletExtruder/nonMRF/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=$(getApplication)

runApplication fluentMeshToFoam nonMRF_Pellet_Extruder_v2.msh

decomposePar

mpirun -np 6 polymSimpleFoam -parallel > log & tail -f log # rausgenommen für Bash-Bearbeitung Scheid
 
echo "Done!"
#------------------------------------------------------------------------------
