run/cases/pelletExtruder/nonMRF/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    wall1
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          16523;
        startFace       423131;
    }
    wall2
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          4188;
        startFace       439654;
    }
    inlet
    {
        type            patch;
        nFaces          1119;
        startFace       443842;
    }
    outlet
    {
        type            patch;
        nFaces          66;
        startFace       444961;
    }
    screw
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          17789;
        startFace       445027;
    }
)

// ************************************************************************* //
